Core/src/Catalogs/ОписиИсходящихДокументовВНалоговыеОрганы/ОписиИсходящихДокументовВНалоговыеОрганы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ОписиИсходящихДокументовВНалоговыеОрганы</name>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>ОписьВходящихДокументов</name>
    <type>
      <types>CatalogRef.ОписиВходящихДокументовИзНалоговыхОрганов</types>
    </type>
  </attributes>
  <attributes>
    <name>Требование</name>
    <type>
      <types>CatalogRef.ДокументыРеализацииПолномочийНалоговыхОрганов</types>
    </type>
  </attributes>
  <attributes>
    <name>Статус</name>
    <type>
      <types>EnumRef.СтатусыПисем</types>
    </type>
  </attributes>
  <attributes>
    <name>НалоговыйОрган</name>
    <type>
      <types>CatalogRef.НалоговыеОрганы</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаСоздания</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ПредставляемыеДокументы</name>
    <attributes>
      <name>ЯвляетсяИнформацией</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ПорядковыйНомер</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>2</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВидДокумента</name>
      <type>
        <types>EnumRef.ВидыПредставляемыхДокументов</types>
      </type>
    </attributes>
    <attributes>
      <name>СсылкаНаОбъект</name>
      <type>
        <types>DefinedType.ЭлементОписиИсходящихДокументовВНалоговыеОрганы</types>
      </type>
    </attributes>
    <attributes>
      <name>Загружен</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Загружен_Номер</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>500</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Загружен_Дата</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Загружен_Контрагент</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>1000</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерДокументаОснования</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>500</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДатаДокументаОснования</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КНД</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>7</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Загружен_Направление</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ИмяФайлаДанных</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>255</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ИмяФайлаПодписи</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>255</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВерсияФайлаДанных</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>ПодтверждениеКНД</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>7</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПодтверждениеИмяФайлаДанных</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>255</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПодтверждениеИмяФайлаПодписи</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>255</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

Core/src/InformationRegisters/СтатусыОтправки/СтатусыОтправки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>СтатусыОтправки</name>
  <resources>
    <name>Статус</name>
    <type>
      <types>EnumRef.СтатусыОтправки</types>
    </type>
  </resources>
  <attributes>
    <name>Основание</name>
    <type>
      <types>CatalogRef.УдалитьОтправкиФСС</types>
      <types>CatalogRef.ОтправкиФСС</types>
      <types>CatalogRef.ОтправкиОтчетности</types>
    </type>
  </attributes>
  <dimensions>
    <name>Объект</name>
    <type>
      <types>DefinedType.ПредметЦиклаОбмена</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Core/src/Enums/СтатусыОтправки/СтатусыОтправки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СтатусыОтправки</name>
  <enumValues>
    <name>ВКонверте</name>
  </enumValues>
  <enumValues>
    <name>Отправлен</name>
  </enumValues>
  <enumValues>
    <name>Доставлен</name>
  </enumValues>
  <enumValues>
    <name>НеПринят</name>
  </enumValues>
  <enumValues>
    <name>Сдан</name>
  </enumValues>
  <enumValues>
    <name>ПринятЕстьОшибки</name>
  </enumValues>
</mdclass:Enum>

Core/src/Catalogs/ОписиИсходящихДокументовВНалоговыеОрганы/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
#Область ПрограммныйИнтерфейс

// Обработчик обновления БРО .
Процедура ОбновитьОписиИсходящихДокументов() Экспорт
	
	КонтекстЭДОСервер = ДокументооборотСКОВызовСервера.ПолучитьОбработкуЭДО();
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ОписиИсходящихДокументовВНалоговыеОрганы.Ссылка КАК ОписьСсылка
	|ИЗ
	|	Справочник.ОписиИсходящихДокументовВНалоговыеОрганы КАК ОписиИсходящихДокументовВНалоговыеОрганы
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СтатусыОтправки КАК СтатусыОтправки
	|		ПО (СтатусыОтправки.Объект = ОписиИсходящихДокументовВНалоговыеОрганы.Ссылка)
	|ГДЕ
	|	ЕСТЬNULL(СтатусыОтправки.Статус, &СтатусВКонверте) = &СтатусВКонверте";	
	
	Запрос.УстановитьПараметр("СтатусВКонверте", Перечисления.СтатусыОтправки.ВКонверте);
	Результат = Запрос.Выполнить();
	
	ВыборкаРезультата = Результат.Выбрать();
	
	Пока ВыборкаРезультата.Следующий() Цикл
		КонтекстЭДОСервер.ОбновитьФайлыДокументовИБОписиИсходящихДокументов(ВыборкаРезультата.ОписьСсылка);
	КонецЦикла;
	
КонецПроцедуры

// Обработчик обновления БРО .
Процедура ОбновитьНаименованиеВсехОписейИсходящихДокументов() Экспорт
	
	КонтекстЭДОСервер = ДокументооборотСКОВызовСервера.ПолучитьОбработкуЭДО();
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ОписиИсходящихДокументовВНалоговыеОрганы.Ссылка КАК ОписьСсылка
	|ИЗ
	|	Справочник.ОписиИсходящихДокументовВНалоговыеОрганы КАК ОписиИсходящихДокументовВНалоговыеОрганы";	
	
	Результат = Запрос.Выполнить();
	
	ВыборкаРезультата = Результат.Выбрать();
	
	Пока ВыборкаРезультата.Следующий() Цикл
		ОписьОбъект = ВыборкаРезультата.ОписьСсылка.ПолучитьОбъект();
		
		Требование = ОписьОбъект.Требование;
		Наименование = НСтр("ka='Ответ на требование о представлении документов';ru='Ответ на требование о представлении документов'");
		Если ЗначениеЗаполнено(Требование) Тогда
			Наименование = Наименование + " " + Строка(Требование.НомерДокумента) + " от " + Формат(Требование.ДатаДокумента, "ДЛФ=D");
		КонецЕсли;
		
		ОписьОбъект.Наименование = Наименование;
		
		ОписьОбъект.ОбменДанными.Загрузка = Истина;
		ОписьОбъект.Записать();
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли

#Область ОбработчикиСобытий

Процедура ОбработкаПолученияФормы(ВидФормы, Параметры, ВыбраннаяФорма, ДополнительнаяИнформация, СтандартнаяОбработка)
	
	// инициализируем контекст ЭДО - модуль обработки
	ТекстСообщения = "";
	КонтекстЭДО = ДокументооборотСКОВызовСервера.ПолучитьОбработкуЭДО(ТекстСообщения);
	Если КонтекстЭДО = Неопределено Тогда 
		Возврат;
	КонецЕсли;
	
	КонтекстЭДО.ОбработкаПолученияФормы("Справочник", "ОписиИсходящихДокументовВНалоговыеОрганы", ВидФормы, Параметры, ВыбраннаяФорма, ДополнительнаяИнформация, СтандартнаяОбработка);
	

КонецПроцедуры

#КонецОбласти
